[
    {
        "id": "academic-1",
        "institution": {
            "es": "IES Maestro Matías Bravo",
            "en": "IES Maestro Matías Bravo",
            "fr": "IES Maestro Matías Bravo",
            "de": "IES Maestro Matías Bravo",
            "it": "IES Maestro Matías Bravo",
            "pt": "IES Maestro Matías Bravo",
            "nl": "IES Maestro Matías Bravo",
            "pl": "IES Maestro Matías Bravo",
            "ru": "IES Maestro Matías Bravo",
            "ja": "IES Maestro Matías Bravo"
        },
        "degree": {
            "es": "Bachillerato",
            "en": "Baccalaureate",
            "fr": "Baccalauréat",
            "de": "Abitur",
            "it": "Diploma di Maturità",
            "pt": "Bacharelado",
            "nl": "Baccalaureaat",
            "pl": "Matura",
            "ru": "Бакалавриат",
            "ja": "バカロレア"
        },
        "field": {
            "es": "Tecnológico",
            "en": "Technology",
            "fr": "Technologie",
            "de": "Technologie",
            "it": "Tecnologia",
            "pt": "Tecnologia",
            "nl": "Technologie",
            "pl": "Technologia",
            "ru": "Технология",
            "ja": "テクノロジー"
        },
        "description": {
            "es": "Formación de educación secundaria superior de carácter preuniversitario, fundamentada en la preparación y realización del examen de acceso a la universidad española (Selectividad/EvAU). Este programa educativo proporciona una base sólida de conocimientos generales con una orientación específica hacia las disciplinas de ingeniería, ciencias aplicadas y tecnologías de la información. Durante este periodo se adquieren las competencias académicas necesarias para afrontar con éxito estudios superiores en áreas técnicas y científicas, desarrollando habilidades analíticas, de razonamiento lógico-matemático y comprensión de principios tecnológicos fundamentales.",
            "en": "Pre-university higher secondary education training, based on preparation for and completion of the Spanish university entrance examination (Selectividad/EvAU). This educational program provides a solid foundation of general knowledge with a specific orientation towards engineering disciplines, applied sciences, and information technologies. During this period, the necessary academic competencies are acquired to successfully undertake higher studies in technical and scientific areas, developing analytical skills, logical-mathematical reasoning, and understanding of fundamental technological principles.",
            "fr": "Formation d'enseignement secondaire supérieur de caractère préuniversitaire, fondée sur la préparation et la réalisation de l'examen d'entrée à l'université espagnole (Selectividad/EvAU). Ce programme éducatif fournit une base solide de connaissances générales avec une orientation spécifique vers les disciplines d'ingénierie, les sciences appliquées et les technologies de l'information. Durant cette période, les compétences académiques nécessaires sont acquises pour entreprendre avec succès des études supérieures dans des domaines techniques et scientifiques, en développant des compétences analytiques, de raisonnement logico-mathématique et de compréhension des principes technologiques fondamentaux.",
            "de": "Voruniversitäre höhere Sekundarschulausbildung, basierend auf der Vorbereitung und Durchführung der spanischen Universitätszugangsprüfung (Selectividad/EvAU). Dieses Bildungsprogramm bietet eine solide Grundlage allgemeiner Kenntnisse mit einer spezifischen Ausrichtung auf Ingenieurdisziplinen, angewandte Wissenschaften und Informationstechnologien. Während dieser Zeit werden die notwendigen akademischen Kompetenzen erworben, um erfolgreich höhere Studien in technischen und wissenschaftlichen Bereichen zu absolvieren, wobei analytische Fähigkeiten, logisch-mathematisches Denken und Verständnis grundlegender technologischer Prinzipien entwickelt werden.",
            "it": "Formazione di istruzione secondaria superiore di carattere preuniversitario, basata sulla preparazione e realizzazione dell'esame di accesso all'università spagnola (Selectividad/EvAU). Questo programma educativo fornisce una solida base di conoscenze generali con un orientamento specifico verso le discipline ingegneristiche, le scienze applicate e le tecnologie dell'informazione. Durante questo periodo si acquisiscono le competenze accademiche necessarie per affrontare con successo studi superiori in aree tecniche e scientifiche, sviluppando abilità analitiche, ragionamento logico-matematico e comprensione dei principi tecnologici fondamentali.",
            "pt": "Formação de ensino secundário superior de caráter pré-universitário, fundamentada na preparação e realização do exame de acesso à universidade espanhola (Selectividad/EvAU). Este programa educativo proporciona uma base sólida de conhecimentos gerais com uma orientação específica para as disciplinas de engenharia, ciências aplicadas e tecnologias da informação. Durante este período, adquirem-se as competências acadêmicas necessárias para enfrentar com sucesso estudos superiores em áreas técnicas e científicas, desenvolvendo habilidades analíticas, raciocínio lógico-matemático e compreensão de princípios tecnológicos fundamentais.",
            "nl": "Vooruniversitaire hogere middelbare schoolopleiding, gebaseerd op voorbereiding voor en voltooiing van het Spaanse universiteitstoelatingexamen (Selectividad/EvAU). Dit onderwijsprogramma biedt een solide basis van algemene kennis met een specifieke oriëntatie op technische disciplines, toegepaste wetenschappen en informatietechnologieën. Tijdens deze periode worden de noodzakelijke academische competenties verworven om met succes hogere studies in technische en wetenschappelijke gebieden te ondernemen, waarbij analytische vaardigheden, logisch-wiskundig redeneren en begrip van fundamentele technologische principes worden ontwikkeld.",
            "pl": "Przeduniwersyteckie wyższe wykształcenie średnie, oparte na przygotowaniu i ukończeniu hiszpańskiego egzaminu wstępnego na uniwersytet (Selectividad/EvAU). Ten program edukacyjny zapewnia solidną podstawę wiedzy ogólnej ze szczególnym ukierunkowaniem na dyscypliny inżynierskie, nauki stosowane i technologie informacyjne. W tym okresie nabywane są niezbędne kompetencje akademickie do pomyślnego podjęcia studiów wyższych w dziedzinach technicznych i naukowych, rozwijając umiejętności analityczne, rozumowanie logiczno-matematyczne i zrozumienie podstawowych zasad technologicznych.",
            "ru": "Доуниверситетское среднее образование высшего уровня, основанное на подготовке и сдаче вступительного экзамена в испанский университет (Selectividad/EvAU). Эта образовательная программа обеспечивает прочную основу общих знаний с конкретной ориентацией на инженерные дисциплины, прикладные науки и информационные технологии. В течение этого периода приобретаются необходимые академические компетенции для успешного проведения высших исследований в технических и научных областях, развивая аналитические навыки, логико-математическое мышление и понимание фундаментальных технологических принципов.",
            "ja": "スペインの大学入学試験（Selectividad/EvAU）の準備と完了に基づく大学準備の高等中等教育訓練。この教育プログラムは、エンジニアリング分野、応用科学、情報技術に特化した一般知識の確固たる基盤を提供します。この期間中、技術的および科学的分野での高等研究を成功裏に行うために必要な学術的能力を獲得し、分析スキル、論理数学的推論、基本的な技術原理の理解を発展させます。"
        },
        "startDate": "2018-09-01",
        "endDate": "2020-06-30",
        "location": {
            "es": "Valdemoro, Madrid, España",
            "en": "Valdemoro, Madrid, Spain",
            "fr": "Valdemoro, Madrid, Espagne",
            "de": "Valdemoro, Madrid, Spanien",
            "it": "Valdemoro, Madrid, Spagna",
            "pt": "Valdemoro, Madrid, Espanha",
            "nl": "Valdemoro, Madrid, Spanje",
            "pl": "Valdemoro, Madryt, Hiszpania",
            "ru": "Вальдеморо, Мадрид, Испания",
            "ja": "バルデモロ、マドリッド、スペイン"
        },
        "achievements": [
            {
                "es": "Aprendizaje de los sistemas digitales",
                "en": "Learning of digital systems",
                "fr": "Apprentissage des systèmes numériques",
                "de": "Erlernen von digitalen Systemen",
                "it": "Apprendimento dei sistemi digitali",
                "pt": "Aprendizagem de sistemas digitais",
                "nl": "Leren van digitale systemen",
                "pl": "Nauka systemów cyfrowych",
                "ru": "Изучение цифровых систем",
                "ja": "デジタルシステムの学習"
            },
            {
                "es": "Establecimiento de lógicas de programación con Processing",
                "en": "Establishing programming logic with Processing",
                "fr": "Établissement de la logique de programmation avec Processing",
                "de": "Etablierung von Programmierlogik mit Processing",
                "it": "Stabilimento della logica di programmazione con Processing",
                "pt": "Estabelecimento de lógica de programação com Processing",
                "nl": "Vestiging van programmeerlogica met Processing",
                "pl": "Ustalanie logiki programowania z Przetwarzaniem",
                "ru": "Установление логики программирования с Processing",
                "ja": "Processingを使用したプログラミングロジックの確立"
            },
            {
                "es": "Matemáticas académicas dirigidas a ingenierías",
                "en": "Academic mathematics focused on engineering",
                "fr": "Mathématiques académiques orientées vers l'ingénierie",
                "de": "Akademische Mathematik auf Ingenieurwissenschaften ausgerichtet",
                "it": "Matematica accademica orientata verso l'ingegneria",
                "pt": "Matemática acadêmica focada em engenharia",
                "nl": "Academische wiskunde gericht op engineering",
                "pl": "Matematyka akademicka ukierunkowana na inżynierię",
                "ru": "Академическая математика, ориентированная на инженерию",
                "ja": "エンジニアリングに焦点を当てた学問的数学"
            },
            {
                "es": "Física avanzada",
                "en": "Advanced physics",
                "fr": "Physique avancée",
                "de": "Fortgeschrittene Physik",
                "it": "Fisica avanzata",
                "pt": "Física avançada",
                "nl": "Geavanceerde fysica",
                "pl": "Fizyka zaawansowana",
                "ru": "Продвинутая физика",
                "ja": "高度な物理学"
            }
        ]
    },
    {
        "id": "academic-2",
        "institution": {
            "es": "Universidad Rey Juan Carlos",
            "en": "Rey Juan Carlos University",
            "fr": "Université Rey Juan Carlos",
            "de": "Universität Rey Juan Carlos",
            "it": "Università Rey Juan Carlos",
            "pt": "Universidade Rey Juan Carlos",
            "nl": "Universiteit Rey Juan Carlos",
            "pl": "Uniwersytet Rey Juan Carlos",
            "ru": "Университет Рея Хуана Карлоса",
            "ja": "レイ・フアン・カルロス大学"
        },
        "degree": {
            "es": "Grado",
            "en": "Bachelor's Degree",
            "fr": "Licence",
            "de": "Bachelor",
            "it": "Laurea",
            "pt": "Bacharelado",
            "nl": "Bachelor",
            "pl": "Licencjat",
            "ru": "Степень бакалавра",
            "ja": "学士号"
        },
        "field": {
            "es": "Ingeniería Informática",
            "en": "Computer Engineering",
            "fr": "Génie Informatique",
            "de": "Computertechnik",
            "it": "Ingegneria Informatica",
            "pt": "Engenharia de Computadores",
            "nl": "Computertechniek",
            "pl": "Inżynieria Komputerowa",
            "ru": "Компьютерная инженерия",
            "ja": "コンピュータ工学"
        },
        "description": {
            "es": "Programa académico integral de grado universitario en ingeniería informática que abarca una formación exhaustiva y multidisciplinar en todas las áreas fundamentales de la computación y el desarrollo tecnológico. El plan de estudios incluye una especialización avanzada en desarrollo de software moderno, arquitectura de sistemas, programación en múltiples paradigmas, diseño de algoritmos eficientes, estructuras de datos complejas, ingeniería de requisitos, metodologías ágiles y ciclo de vida completo del software. Además, se profundiza en áreas complementarias como bases de datos relacionales y no relacionales, sistemas operativos, redes de computadoras, seguridad informática, computación distribuida y paralela, inteligencia artificial, visión por computador, robótica aplicada y desarrollo de aplicaciones web y móviles multiplataforma.",
            "en": "Comprehensive undergraduate academic program in computer engineering covering exhaustive and multidisciplinary training in all fundamental areas of computing and technological development. The curriculum includes advanced specialization in modern software development, systems architecture, multi-paradigm programming, efficient algorithm design, complex data structures, requirements engineering, agile methodologies, and complete software lifecycle. Additionally, complementary areas such as relational and non-relational databases, operating systems, computer networks, information security, distributed and parallel computing, artificial intelligence, computer vision, applied robotics, and cross-platform web and mobile application development are studied in depth.",
            "fr": "Programme académique complet de premier cycle en génie informatique couvrant une formation exhaustive et multidisciplinaire dans tous les domaines fondamentaux de l'informatique et du développement technologique. Le programme d'études comprend une spécialisation avancée en développement de logiciels modernes, architecture de systèmes, programmation multi-paradigmes, conception d'algorithmes efficaces, structures de données complexes, ingénierie des exigences, méthodologies agiles et cycle de vie complet du logiciel. De plus, des domaines complémentaires tels que les bases de données relationnelles et non relationnelles, les systèmes d'exploitation, les réseaux informatiques, la sécurité de l'information, l'informatique distribuée et parallèle, l'intelligence artificielle, la vision par ordinateur, la robotique appliquée et le développement d'applications web et mobiles multiplateformes sont approfondis.",
            "de": "Umfassendes akademisches Undergraduate-Programm in Computertechnik, das eine erschöpfende und multidisziplinäre Ausbildung in allen grundlegenden Bereichen der Informatik und technologischen Entwicklung abdeckt. Der Lehrplan umfasst eine fortgeschrittene Spezialisierung in moderner Softwareentwicklung, Systemarchitektur, Multi-Paradigmen-Programmierung, effizientem Algorithmendesign, komplexen Datenstrukturen, Requirements Engineering, agilen Methoden und vollständigem Software-Lebenszyklus. Darüber hinaus werden ergänzende Bereiche wie relationale und nicht-relationale Datenbanken, Betriebssysteme, Computernetzwerke, Informationssicherheit, verteilte und parallele Verarbeitung, künstliche Intelligenz, Computer Vision, angewandte Robotik und plattformübergreifende Web- und Mobile-Anwendungsentwicklung vertieft.",
            "it": "Programma accademico integrale di laurea in ingegneria informatica che copre una formazione esaustiva e multidisciplinare in tutte le aree fondamentali dell'informatica e dello sviluppo tecnologico. Il piano di studi include una specializzazione avanzata nello sviluppo di software moderno, architettura di sistemi, programmazione multi-paradigma, progettazione di algoritmi efficienti, strutture dati complesse, ingegneria dei requisiti, metodologie agili e ciclo di vita completo del software. Inoltre, si approfondiscono aree complementari come database relazionali e non relazionali, sistemi operativi, reti di computer, sicurezza informatica, computazione distribuita e parallela, intelligenza artificiale, visione artificiale, robotica applicata e sviluppo di applicazioni web e mobile multipiattaforma.",
            "pt": "Programa acadêmico integral de graduação em engenharia de computadores que abrange uma formação exaustiva e multidisciplinar em todas as áreas fundamentais da computação e desenvolvimento tecnológico. O currículo inclui uma especialização avançada em desenvolvimento de software moderno, arquitetura de sistemas, programação multi-paradigma, design de algoritmos eficientes, estruturas de dados complexas, engenharia de requisitos, metodologias ágeis e ciclo de vida completo do software. Além disso, aprofunda-se em áreas complementares como bancos de dados relacionais e não relacionais, sistemas operacionais, redes de computadores, segurança da informação, computação distribuída e paralela, inteligência artificial, visão computacional, robótica aplicada e desenvolvimento de aplicações web e móveis multiplataforma.",
            "nl": "Uitgebreid academisch undergraduate-programma in computertechniek dat een uitputtende en multidisciplinaire opleiding dekt in alle fundamentele gebieden van computing en technologische ontwikkeling. Het curriculum omvat geavanceerde specialisatie in moderne softwareontwikkeling, systeemarchitectuur, multi-paradigma programmering, efficiënt algoritme-ontwerp, complexe gegevensstructuren, requirements engineering, agile methodologieën en volledige softwarelevenscyclus. Bovendien worden complementaire gebieden zoals relationele en niet-relationele databases, besturingssystemen, computernetwerken, informatiebeveiliging, gedistribueerde en parallelle computing, kunstmatige intelligentie, computer vision, toegepaste robotica en platformonafhankelijke web- en mobiele applicatieontwikkeling diepgaand bestudeerd.",
            "pl": "Kompleksowy akademicki program studiów licencjackich z inżynierii komputerowej obejmujący wyczerpujące i multidyscyplinarne szkolenie we wszystkich podstawowych obszarach informatyki i rozwoju technologicznego. Program studiów obejmuje zaawansowaną specjalizację w nowoczesnym tworzeniu oprogramowania, architekturze systemów, programowaniu wieloparadygmatowym, projektowaniu wydajnych algorytmów, złożonych strukturach danych, inżynierii wymagań, metodologiach zwinnych i pełnym cyklu życia oprogramowania. Ponadto zgłębiane są obszary uzupełniające, takie jak relacyjne i nierelacyjne bazy danych, systemy operacyjne, sieci komputerowe, bezpieczeństwo informacji, obliczenia rozproszone i równoległe, sztuczna inteligencja, widzenie komputerowe, robotyka stosowana i tworzenie aplikacji internetowych i mobilnych wieloplatformowych.",
            "ru": "Комплексная академическая программа бакалавриата по компьютерной инженерии, охватывающая исчерпывающее и многодисциплинарное обучение во всех фундаментальных областях вычислительной техники и технологического развития. Учебный план включает продвинутую специализацию в современной разработке программного обеспечения, архитектуре систем, мультипарадигменном программировании, эффективном проектировании алгоритмов, сложных структурах данных, инженерии требований, гибких методологиях и полном жизненном цикле программного обеспечения. Кроме того, углубленно изучаются дополнительные области, такие как реляционные и нереляционные базы данных, операционные системы, компьютерные сети, информационная безопасность, распределенные и параллельные вычисления, искусственный интеллект, компьютерное зрение, прикладная робототехника и разработка кросс-платформенных веб- и мобильных приложений.",
            "ja": "コンピューティングと技術開発のすべての基本領域における包括的かつ学際的なトレーニングをカバーする、コンピュータ工学の包括的な学部学術プログラム。カリキュラムには、モダンなソフトウェア開発、システムアーキテクチャ、マルチパラダイムプログラミング、効率的なアルゴリズム設計、複雑なデータ構造、要件工学、アジャイル方法論、完全なソフトウェアライフサイクルにおける高度な専門化が含まれています。さらに、リレーショナルおよび非リレーショナルデータベース、オペレーティングシステム、コンピュータネットワーク、情報セキュリティ、分散および並列コンピューティング、人工知能、コンピュータビジョン、応用ロボティクス、クロスプラットフォームのWebおよびモバイルアプリケーション開発などの補完的な領域を深く研究します。"
        },
        "startDate": "2020-09-01",
        "endDate": "2025-06-30",
        "location": {
            "es": "Móstoles, Madrid, España",
            "en": "Móstoles, Madrid, Spain",
            "fr": "Móstoles, Madrid, Espagne",
            "de": "Móstoles, Madrid, Spanien",
            "it": "Móstoles, Madrid, Spagna",
            "pt": "Móstoles, Madrid, Espanha",
            "nl": "Móstoles, Madrid, Spanje",
            "pl": "Móstoles, Madryt, Hiszpania",
            "ru": "Мостолес, Мадрид, Испания",
            "ja": "モストレス、マドリッド、スペイン"
        },
        "achievements": [
            {
                "es": "Desarrollo de aplicaciones web y móviles, incluyendo backends y frontends modernos.",
                "en": "Web and mobile application development, including modern backends and frontends.",
                "fr": "Développement d'applications web et mobiles, incluant les backends et frontends modernes.",
                "de": "Web- und Mobilanwendungsentwicklung, einschließlich moderner Backends und Frontends.",
                "it": "Sviluppo di applicazioni web e mobili, inclusi backend e frontend moderni.",
                "pt": "Desenvolvimento de aplicativos web e móvel, incluindo backends e frontends modernos.",
                "nl": "Web- en mobiele applicatieontwikkeling, inclusief moderne backends en frontends.",
                "pl": "Tworzenie aplikacji internetowych i mobilnych, w tym nowoczesne backendy i frontendy.",
                "ru": "Разработка веб-приложений и мобильных приложений, включая современные бэкенды и фронтенды.",
                "ja": "モダンなバックエンドとフロントエンドを含む、WebおよびモバイルアプリケーションDevelopment。"
            },
            {
                "es": "Especialización en arquitectura de software y proyectos con tecnologías actuales.",
                "en": "Specialization in software architecture and projects with current technologies.",
                "fr": "Spécialisation en architecture logicielle et projets avec les technologies actuelles.",
                "de": "Spezialisierung auf Softwarearchitektur et Projekte mit aktuellen Technologien.",
                "it": "Specializzazione in architettura software e progetti con tecnologie attuali.",
                "pt": "Especialização em arquitetura de software e projetos com tecnologias atuais.",
                "nl": "Specialisatie in software-architectuur en projecten met huidige technologieën.",
                "pl": "Specjalizacja w architekturze oprogramowania i projektach z bieżącymi technologiami.",
                "ru": "Специализация на архитектуре программного обеспечения и проектах с современными технологиями.",
                "ja": "ソフトウェアアーキテクチャおよび現在のテクノロジーを使用したプロジェクトの専門化。"
            },
            {
                "es": "Programación concurrente, distribuida y sistemas operativos avanzados.",
                "en": "Concurrent and distributed programming with advanced operating systems.",
                "fr": "Programmation concurrente et distribuée avec systèmes d'exploitation avancés.",
                "de": "Nebenläufige und verteilte Programmierung mit fortgeschrittenen Betriebssystemen.",
                "it": "Programmazione concorrente e distribuita con sistemi operativi avanzati.",
                "pt": "Programação concorrente e distribuída com sistemas operacionais avançados.",
                "nl": "Gelijktijdige en gedistribueerde programmering met geavanceerde besturingssystemen.",
                "pl": "Programowanie równoczesne i rozproszone z zaawansowanymi systemami operacyjnymi.",
                "ru": "Параллельное и распределенное программирование с продвинутыми операционными системами.",
                "ja": "高度なオペレーティングシステムを使用した並行および分散プログラミング。"
            },
            {
                "es": "Sistemas inteligentes, visión artificial y robótica/domótica aplicada.",
                "en": "Intelligent systems, artificial vision and applied robotics/home automation.",
                "fr": "Systèmes intelligents, vision artificielle et robotique/domotique appliquée.",
                "de": "Intelligente Systeme, künstliches Sehen und angewandte Robotik/Hausautomation.",
                "it": "Sistemi intelligenti, visione artificiale e robotica/domotica applicata.",
                "pt": "Sistemas inteligentes, visão artificial e robótica/automação residencial aplicada.",
                "nl": "Intelligente systemen, kunstmatig zien en toegepaste robotica/huisautomatie.",
                "pl": "Systemy inteligentne, widzenie sztuczne i zastosowana robotyka/domotyka.",
                "ru": "Интеллектуальные системы, искусственное зрение и прикладная робототехника/домашняя автоматизация.",
                "ja": "インテリジェントシステム、人工ビジョン、および応用ロボットシステム/ホームオートメーション。"
            },
            {
                "es": "Diseño y optimización de bases de datos, redes y computación de altas prestaciones.",
                "en": "Design and optimization of databases, networks and high-performance computing.",
                "fr": "Conception et optimisation des bases de données, réseaux et informatique haute performance.",
                "de": "Entwurf und Optimierung von Datenbanken, Netzwerken und High-Performance-Computing.",
                "it": "Progettazione e ottimizzazione di database, reti e calcolo ad alte prestazioni.",
                "pt": "Projeto e otimização de bancos de dados, redes e computação de alto desempenho.",
                "nl": "Ontwerp en optimalisering van databases, netwerken en high-performance computing.",
                "pl": "Projektowanie i optymalizacja baz danych, sieci i obliczeniówwysokiej wydajności.",
                "ru": "Проектирование и оптимизация баз данных, сетей и высокопроизводительных вычислений.",
                "ja": "データベース、ネットワーク、および高性能コンピューティングの設計と最適化。"
            }
        ]
    },
    {
        "id": "academic-3",
        "institution": {
            "es": "BigSchool & Universidad Isabel I",
            "en": "BigSchool & Isabel I University",
            "fr": "BigSchool & Université Isabel I",
            "de": "BigSchool & Universität Isabel I",
            "it": "BigSchool & Università Isabel I",
            "pt": "BigSchool & Universidade Isabel I",
            "nl": "BigSchool & Universiteit Isabel I",
            "pl": "BigSchool & Uniwersytet Isabel I",
            "ru": "BigSchool и Университет Изабель I",
            "ja": "BigSchoolとイサベルI大学"
        },
        "degree": {
            "es": "Máster",
            "en": "Master's Degree",
            "fr": "Master",
            "de": "Masterabschluss",
            "it": "Laurea Magistrale",
            "pt": "Mestrado",
            "nl": "Masterdiploma",
            "pl": "Magister",
            "ru": "Степень магистра",
            "ja": "修士号"
        },
        "field": {
            "es": "Desarrollo con Inteligencia Artificial",
            "en": "Development with Artificial Intelligence",
            "fr": "Développement avec Intelligence Artificielle",
            "de": "Entwicklung mit künstlicher Intelligenz",
            "it": "Sviluppo con Intelligenza Artificiale",
            "pt": "Desenvolvimento com Inteligência Artificial",
            "nl": "Ontwikkeling met Kunstmatige Intelligentie",
            "pl": "Rozwój ze Sztuczną Inteligencją",
            "ru": "Разработка с искусственным интеллектом",
            "ja": "人工知能による開発"
        },
        "description": {
            "es": "Programa de posgrado avanzado enfocado en la especialización profesional en el campo de la inteligencia artificial y el aprendizaje automático (machine learning), con una orientación práctica hacia su aplicación directa en el desarrollo de software moderno y soluciones tecnológicas innovadoras. El máster abarca el estudio profundo de algoritmos de aprendizaje supervisado y no supervisado, redes neuronales profundas (deep learning), procesamiento de lenguaje natural (NLP), visión artificial, análisis predictivo, big data, frameworks y librerías especializadas como TensorFlow, PyTorch y scikit-learn. Se enfatiza el desarrollo de proyectos reales que integran capacidades de IA en aplicaciones empresariales, sistemas de recomendación, automatización inteligente, análisis de datos masivos y la implementación de modelos de machine learning en entornos de producción escalables, siguiendo las mejores prácticas de MLOps y arquitecturas cloud.",
            "en": "Advanced postgraduate program focused on professional specialization in the field of artificial intelligence and machine learning, with a practical orientation towards its direct application in modern software development and innovative technological solutions. The master's degree covers in-depth study of supervised and unsupervised learning algorithms, deep neural networks (deep learning), natural language processing (NLP), computer vision, predictive analytics, big data, and specialized frameworks and libraries such as TensorFlow, PyTorch, and scikit-learn. Emphasis is placed on developing real projects that integrate AI capabilities into business applications, recommendation systems, intelligent automation, massive data analysis, and implementing machine learning models in scalable production environments, following MLOps best practices and cloud architectures.",
            "fr": "Programme de troisième cycle avancé axé sur la spécialisation professionnelle dans le domaine de l'intelligence artificielle et de l'apprentissage automatique (machine learning), avec une orientation pratique vers son application directe dans le développement de logiciels modernes et les solutions technologiques innovantes. Le master couvre l'étude approfondie des algorithmes d'apprentissage supervisé et non supervisé, des réseaux de neurones profonds (deep learning), du traitement du langage naturel (NLP), de la vision par ordinateur, de l'analyse prédictive, du big data et des frameworks et bibliothèques spécialisés tels que TensorFlow, PyTorch et scikit-learn. L'accent est mis sur le développement de projets réels qui intègrent des capacités d'IA dans les applications d'entreprise, les systèmes de recommandation, l'automatisation intelligente, l'analyse de données massives et la mise en œuvre de modèles d'apprentissage automatique dans des environnements de production évolutifs, en suivant les meilleures pratiques MLOps et les architectures cloud.",
            "de": "Fortgeschrittenes Postgraduiertenprogramm mit Schwerpunkt auf beruflicher Spezialisierung im Bereich künstliche Intelligenz und maschinelles Lernen, mit praktischer Ausrichtung auf deren direkte Anwendung in moderner Softwareentwicklung und innovativen technologischen Lösungen. Der Master umfasst eingehende Studien von überwachten und unüberwachten Lernalgorithmen, tiefen neuronalen Netzwerken (Deep Learning), natürlicher Sprachverarbeitung (NLP), Computer Vision, prädiktiver Analytik, Big Data und spezialisierten Frameworks und Bibliotheken wie TensorFlow, PyTorch und scikit-learn. Der Schwerpunkt liegt auf der Entwicklung realer Projekte, die KI-Fähigkeiten in Geschäftsanwendungen, Empfehlungssysteme, intelligente Automatisierung, massive Datenanalyse und die Implementierung von Machine-Learning-Modellen in skalierbaren Produktionsumgebungen integrieren, unter Befolgung der MLOps-Best-Practices und Cloud-Architekturen.",
            "it": "Programma post-laurea avanzato incentrato sulla specializzazione professionale nel campo dell'intelligenza artificiale e dell'apprendimento automatico (machine learning), con un orientamento pratico verso la sua applicazione diretta nello sviluppo di software moderno e soluzioni tecnologiche innovative. Il master copre lo studio approfondito di algoritmi di apprendimento supervisionato e non supervisionato, reti neurali profonde (deep learning), elaborazione del linguaggio naturale (NLP), visione artificiale, analisi predittiva, big data e framework e librerie specializzati come TensorFlow, PyTorch e scikit-learn. Si pone l'accento sullo sviluppo di progetti reali che integrano capacità di IA in applicazioni aziendali, sistemi di raccomandazione, automazione intelligente, analisi di dati massivi e implementazione di modelli di machine learning in ambienti di produzione scalabili, seguendo le migliori pratiche MLOps e architetture cloud.",
            "pt": "Programa de pós-graduação avançado focado na especialização profissional no campo da inteligência artificial e aprendizado de máquina (machine learning), com uma orientação prática para sua aplicação direta no desenvolvimento de software moderno e soluções tecnológicas inovadoras. O mestrado abrange o estudo aprofundado de algoritmos de aprendizado supervisionado e não supervisionado, redes neurais profundas (deep learning), processamento de linguagem natural (NLP), visão computacional, análise preditiva, big data e frameworks e bibliotecas especializados como TensorFlow, PyTorch e scikit-learn. Enfatiza-se o desenvolvimento de projetos reais que integram capacidades de IA em aplicações empresariais, sistemas de recomendação, automação inteligente, análise de dados massivos e implementação de modelos de machine learning em ambientes de produção escaláveis, seguindo as melhores práticas de MLOps e arquiteturas cloud.",
            "nl": "Geavanceerd postacademisch programma gericht op professionele specialisatie op het gebied van kunstmatige intelligentie en machine learning, met een praktische oriëntatie op de directe toepassing ervan in moderne softwareontwikkeling en innovatieve technologische oplossingen. De master omvat diepgaande studie van gecontroleerde en ongecontroleerde leeralgoritmen, diepe neurale netwerken (deep learning), natuurlijke taalverwerking (NLP), computer vision, voorspellende analyse, big data en gespecialiseerde frameworks en bibliotheken zoals TensorFlow, PyTorch en scikit-learn. De nadruk ligt op de ontwikkeling van echte projecten die AI-mogelijkheden integreren in zakelijke toepassingen, aanbevelingssystemen, intelligente automatisering, massale gegevensanalyse en het implementeren van machine learning-modellen in schaalbare productieomgevingen, volgens MLOps-best practices en cloud-architecturen.",
            "pl": "Zaawansowany program podyplomowy skoncentrowany na profesjonalnej specjalizacji w dziedzinie sztucznej inteligencji i uczenia maszynowego (machine learning), z praktyczną orientacją na jego bezpośrednie zastosowanie w nowoczesnym tworzeniu oprogramowania i innowacyjnych rozwiązaniach technologicznych. Program magisterski obejmuje dogłębne studium algorytmów uczenia nadzorowanego i nienadzorowanego, głębokich sieci neuronowych (deep learning), przetwarzania języka naturalnego (NLP), wizji komputerowej, analizy predykcyjnej, big data oraz specjalistycznych frameworków i bibliotek, takich jak TensorFlow, PyTorch i scikit-learn. Nacisk kładzie się na tworzenie rzeczywistych projektów integrujących możliwości AI w aplikacjach biznesowych, systemach rekomendacji, inteligentnej automatyzacji, analizie masowych danych i wdrażaniu modeli uczenia maszynowego w skalowalnych środowiskach produkcyjnych, zgodnie z najlepszymi praktykami MLOps i architekturami chmury.",
            "ru": "Продвинутая аспирантская программа, ориентированная на профессиональную специализацию в области искусственного интеллекта и машинного обучения, с практической направленностью на его прямое применение в современной разработке программного обеспечения и инновационных технологических решениях. Магистратура охватывает углубленное изучение алгоритмов контролируемого и неконтролируемого обучения, глубоких нейронных сетей (deep learning), обработки естественного языка (NLP), компьютерного зрения, прогностической аналитики, больших данных и специализированных фреймворков и библиотек, таких как TensorFlow, PyTorch и scikit-learn. Акцент делается на разработке реальных проектов, которые интегрируют возможности ИИ в бизнес-приложения, системы рекомендаций, интеллектуальную автоматизацию, анализ массовых данных и внедрение моделей машинного обучения в масштабируемые производственные среды, следуя лучшим практикам MLOps и облачным архитектурам.",
            "ja": "モダンなソフトウェア開発と革新的な技術ソリューションへの直接的な応用に向けた実践的な方向性を持つ、人工知能と機械学習分野における専門的特化に焦点を当てた高度な大学院プログラム。修士課程では、教師あり学習と教師なし学習アルゴリズム、深層ニューラルネットワーク（ディープラーニング）、自然言語処理（NLP）、コンピュータビジョン、予測分析、ビッグデータ、TensorFlow、PyTorch、scikit-learnなどの専門的なフレームワークとライブラリの徹底的な研究をカバーします。ビジネスアプリケーション、推奨システム、インテリジェント自動化、大規模データ分析にAI機能を統合し、MLOpsのベストプラクティスとクラウドアーキテクチャに従ってスケーラブルな本番環境に機械学習モデルを実装する実際のプロジェクトの開発に重点が置かれています。"
        },
        "startDate": "2025-10-01",
        "endDate": null,
        "location": {
            "es": "Telemática, España",
            "en": "Online, Spain",
            "fr": "Télématique, Espagne",
            "de": "Telematik, Spanien",
            "it": "Telematica, Spagna",
            "pt": "Telemática, Espanha",
            "nl": "Telematica, Spanje",
            "pl": "Telematyka, Hiszpania",
            "ru": "Телематика, Испания",
            "ja": "テレマティクス、スペイン"
        },
        "achievements": [
            {
                "es": "Especialización en IA y machine learning",
                "en": "Specialization in AI and machine learning",
                "fr": "Spécialisation en IA et apprentissage automatique",
                "de": "Spezialisierung auf KI und maschinelles Lernen",
                "it": "Specializzazione in IA e apprendimento automatico",
                "pt": "Especialização em IA e aprendizado de máquina",
                "nl": "Specialisatie in AI en machine learning",
                "pl": "Specjalizacja w AI i uczeniu maszynowym",
                "ru": "Специализация на искусственном интеллекте и машинном обучении",
                "ja": "AIと機械学習の専門化"
            },
            {
                "es": "Desarrollo de aplicaciones inteligentes",
                "en": "Development of intelligent applications",
                "fr": "Développement d'applications intelligentes",
                "de": "Entwicklung intelligenter Anwendungen",
                "it": "Sviluppo di applicazioni intelligenti",
                "pt": "Desenvolvimento de aplicativos inteligentes",
                "nl": "Ontwikkeling van intelligente toepassingen",
                "pl": "Opracowywanie inteligentnych aplikacji",
                "ru": "Разработка интеллектуальных приложений",
                "ja": "インテリジェントアプリケーションの開発"
            },
            {
                "es": "Formación actualizada en tecnologías emergentes",
                "en": "Updated training in emerging technologies",
                "fr": "Formation à jour sur les technologies émergentes",
                "de": "Schulung in aufstrebenden Technologien",
                "it": "Formazione aggiornata su tecnologie emergenti",
                "pt": "Treinamento atualizado em tecnologias emergentes",
                "nl": "Actuele training in opkomende technologieën",
                "pl": "Zaktualizowane szkolenie z technologii wschodzących",
                "ru": "Обновленное обучение новым технологиям",
                "ja": "新興技術の最新トレーニング"
            }
        ]
    }
]
