{
    "name": "Sebastián Ramiro Entrerrios García",
    "name_long": "Sebastián Entrerrios García",
    "name_medium": "Sebastián",
    "name_short": "Sebas",
    "description": {
        "es": "Mi personalidad se sostiene sobre tres pilares fundamentales.\n\n El primero es la curiosidad: un motor imprescindible en el mundo de la informática que me impulsa a mantenerme atento a las novedades del mercado y, al mismo tiempo, a profundizar y ampliar mi formación de manera constante. Gracias a ella, no solo descubro nuevas herramientas y tendencias, sino que también desarrollo una mirada crítica que me ayuda a entender por qué surgen, para qué sirven y cómo pueden aportar valor real.\n\nEl segundo pilar es la constancia. En un ámbito que crece y se transforma día a día, los proyectos son cada vez más grandes y sofisticados. La constancia me permite sostener el esfuerzo, organizar el trabajo y atravesar la posible monotonía que a veces aparece, sin perder el foco ni la calidad. Es la disciplina que convierte las buenas intenciones en resultados y que hace que las metas se alcancen paso a paso.\n\nPor último, la responsabilidad —tanto individual como de equipo—. Considero esencial asumir cada tarea de forma adecuada y profesional, entendiendo el impacto que tiene en el conjunto y actuando con compromiso. Dar siempre lo mejor de mí es una forma de respeto hacia el proyecto y hacia las personas que colaboran en él; es la base para sacar adelante cualquier tipo de iniciativa y para construir confianza en el tiempo.",
        "en": "My personality is built on three fundamental pillars.\n\n The first is curiosity: an essential engine in the field of computing that keeps me attentive to market developments and, at the same time, pushes me to deepen and continuously expand my training. Thanks to it, I not only discover new tools and trends, but also cultivate a critical perspective that helps me understand why they emerge, what they are for, and how they can deliver real value.\n\nThe second pillar is constancy. In a domain that grows and transforms day by day, projects are increasingly large and sophisticated. Constancy allows me to sustain effort, organize work, and move through the possible monotony that sometimes appears without losing focus or quality. It is the discipline that turns good intentions into results and makes goals achievable step by step.\n\nLastly, responsibility — both individual and as a team. I consider it essential to take on each task properly and professionally, understanding its impact on the whole and acting with commitment. Always giving my best is a form of respect for the project and for the people who collaborate in it; it is the foundation for bringing any initiative forward and for building trust over time.",
        "fr": "Ma personnalité repose sur trois piliers fondamentaux.\n\n Le premier est la curiosité : un moteur indispensable dans le monde de l’informatique qui me pousse à rester attentif aux nouveautés du marché et, en même temps, à approfondir et à élargir en continu ma formation. Grâce à elle, je découvre non seulement de nouveaux outils et tendances, mais je développe aussi un regard critique qui m’aide à comprendre pourquoi ils apparaissent, à quoi ils servent et comment ils peuvent apporter une valeur réelle.\n\nLe deuxième pilier est la constance. Dans un domaine qui grandit et se transforme jour après jour, les projets sont de plus en plus grands et sophistiqués. La constance me permet de soutenir l’effort, d’organiser le travail et de traverser la possible monotonie qui peut survenir, sans perdre le focus ni la qualité. C’est la discipline qui transforme les bonnes intentions en résultats et qui permet d’atteindre les objectifs pas à pas.\n\nEnfin, la responsabilité — individuelle comme collective. Je considère essentiel d’assumer chaque tâche de manière adéquate et professionnelle, en comprenant son impact sur l’ensemble et en agissant avec engagement. Donner toujours le meilleur de moi-même est une forme de respect envers le projet et les personnes qui y collaborent ; c’est le socle pour faire avancer toute initiative et construire la confiance dans le temps.",
        "de": "Meine Persönlichkeit beruht auf drei grundlegenden Säulen.\n\n Die erste ist die Neugier: ein unverzichtbarer Motor in der Informatik, der mich dazu bringt, Entwicklungen am Markt aufmerksam zu verfolgen und gleichzeitig meine Ausbildung kontinuierlich zu vertiefen und zu erweitern. Dank ihr entdecke ich nicht nur neue Werkzeuge und Trends, sondern entwickle auch einen kritischen Blick, der mir hilft zu verstehen, warum sie entstehen, wozu sie dienen und wie sie echten Mehrwert liefern können.\n\nDie zweite Säule ist die Beständigkeit. In einem Bereich, der sich Tag für Tag weiterentwickelt und verändert, werden Projekte immer größer und anspruchsvoller. Beständigkeit ermöglicht es mir, den Einsatz aufrechtzuerhalten, die Arbeit zu organisieren und mögliche Monotonie zu durchlaufen, ohne Fokus oder Qualität zu verlieren. Sie ist die Disziplin, die gute Absichten in Ergebnisse verwandelt und Ziele Schritt für Schritt erreichbar macht.\n\nUnd schließlich die Verantwortung — sowohl individuell als auch im Team. Ich halte es für wesentlich, jede Aufgabe angemessen und professionell zu übernehmen, ihren Einfluss auf das Ganze zu verstehen und mit Engagement zu handeln. Immer mein Bestes zu geben ist eine Form des Respekts gegenüber dem Projekt und den Menschen, die daran mitarbeiten; es ist die Grundlage dafür, jede Initiative voranzubringen und über die Zeit Vertrauen aufzubauen.",
        "it": "La mia personalità si regge su tre pilastri fondamentali.\n\n Il primo è la curiosità: un motore imprescindibile nel mondo dell’informatica che mi spinge a rimanere attento alle novità del mercato e, allo stesso tempo, ad approfondire e ampliare costantemente la mia formazione. Grazie ad essa non solo scopro nuovi strumenti e tendenze, ma sviluppo anche uno sguardo critico che mi aiuta a capire perché nascono, a cosa servono e come possono generare valore reale.\n\nIl secondo pilastro è la costanza. In un ambito che cresce e si trasforma giorno dopo giorno, i progetti sono sempre più grandi e sofisticati. La costanza mi consente di sostenere lo sforzo, organizzare il lavoro e attraversare la possibile monotonia che talvolta compare, senza perdere il focus né la qualità. È la disciplina che trasforma le buone intenzioni in risultati e rende gli obiettivi raggiungibili passo dopo passo.\n\nInfine, la responsabilità — sia individuale sia di squadra. Ritengo essenziale affrontare ogni compito in modo adeguato e professionale, comprendendone l’impatto sull’insieme e agendo con impegno. Dare sempre il meglio di me è una forma di rispetto verso il progetto e verso le persone che vi collaborano; è la base per portare avanti qualsiasi iniziativa e costruire fiducia nel tempo.",
        "pt": "A minha personalidade apoia‑se em três pilares fundamentais.\n\n O primeiro é a curiosidade: um motor indispensável no mundo da informática que me leva a estar atento às novidades do mercado e, ao mesmo tempo, a aprofundar e ampliar continuamente a minha formação. Graças a ela, não apenas descubro novas ferramentas e tendências, como também desenvolvo um olhar crítico que me ajuda a entender por que surgem, para que servem e como podem gerar valor real.\n\nO segundo pilar é a constância. Num ambiente que cresce e se transforma dia após dia, os projetos são cada vez maiores e mais sofisticados. A constância permite‑me sustentar o esforço, organizar o trabalho e atravessar a possível monotonia que, por vezes, aparece, sem perder o foco nem a qualidade. É a disciplina que converte boas intenções em resultados e faz com que os objetivos sejam alcançados passo a passo.\n\nPor fim, a responsabilidade — tanto individual quanto em equipe. Considero essencial assumir cada tarefa de maneira adequada e profissional, compreendendo o seu impacto no conjunto e atuando com compromisso. Dar sempre o meu melhor é uma forma de respeito pelo projeto e pelas pessoas que nele colaboram; é a base para levar adiante qualquer iniciativa e construir confiança ao longo do tempo.",
        "nl": "Mijn persoonlijkheid steunt op drie fundamentele pijlers.\n\n De eerste is nieuwsgierigheid: een onmisbare motor in de wereld van de informatica die mij ertoe aanzet alert te blijven op marktontwikkelingen en tegelijk mijn opleiding voortdurend te verdiepen en uit te breiden. Dankzij die nieuwsgierigheid ontdek ik niet alleen nieuwe tools en trends, maar ontwikkel ik ook een kritische blik die mij helpt te begrijpen waarom ze ontstaan, waarvoor ze dienen en hoe ze echte waarde kunnen leveren.\n\nDe tweede pijler is consistentie. In een domein dat dag na dag groeit en verandert, worden projecten steeds groter en geavanceerder. Consistentie stelt me in staat om inspanning vol te houden, het werk te organiseren en door mogelijke monotonie heen te gaan zonder focus of kwaliteit te verliezen. Het is de discipline die goede bedoelingen omzet in resultaten en doelen stap voor stap haalbaar maakt.\n\nTot slot verantwoordelijkheid — zowel individueel als in teamverband. Ik vind het essentieel om elke taak op een passende en professionele manier op te nemen, de impact op het geheel te begrijpen en met betrokkenheid te handelen. Altijd het beste van mezelf geven is een vorm van respect voor het project en voor de mensen die eraan meewerken; het vormt de basis om elke initiatief vooruit te helpen en in de tijd vertrouwen op te bouwen.",
        "pl": "Moja osobowość opiera się na trzech fundamentalnych filarach.\n\n Pierwszym jest ciekawość — niezbędny motor w świecie informatyki, który skłania mnie do uważnego śledzenia nowości rynkowych, a jednocześnie do pogłębiania i nieustannego rozszerzania własnego rozwoju. Dzięki niej nie tylko odkrywam nowe narzędzia i trendy, lecz także rozwijam krytyczne spojrzenie, które pomaga mi zrozumieć, dlaczego się pojawiają, do czego służą i jak mogą dostarczać realną wartość.\n\nDrugim filarem jest konsekwencja. W obszarze, który z dnia na dzień rośnie i się zmienia, projekty stają się coraz większe i bardziej zaawansowane. Konsekwencja pozwala mi podtrzymywać wysiłek, organizować pracę i przechodzić przez możliwą monotonię, nie tracąc przy tym skupienia ani jakości. To dyscyplina, która zamienia dobre intencje w rezultaty i sprawia, że cele są osiągane krok po kroku.\n\nI wreszcie odpowiedzialność — zarówno indywidualna, jak i zespołowa. Uważam za kluczowe podejmowanie każdego zadania w sposób właściwy i profesjonalny, rozumiejąc jego wpływ na całość i działając z zaangażowaniem. Dając zawsze z siebie wszystko, okazuję szacunek dla projektu i osób, które nad nim współpracują; to fundament, który pozwala realizować każdą inicjatywę i budować zaufanie w czasie.",
        "ru": "Моя личность опирается на три фундаментальные опоры.\n\n Первая — любопытство: незаменимый двигатель в мире информатики, который побуждает меня внимательно следить за новинками рынка и одновременно постоянно углублять и расширять своё обучение. Благодаря ему я не только открываю новые инструменты и тренды, но и развиваю критический взгляд, помогающий понять, почему они появляются, для чего служат и как способны приносить реальную ценность.\n\nВторая опора — постоянство. В сфере, которая растёт и меняется изо дня в день, проекты становятся всё более масштабными и сложными. Постоянство позволяет поддерживать усилия, организовывать работу и преодолевать возможную монотонность, не теряя фокуса и качества. Это дисциплина, превращающая хорошие намерения в результаты и делающая цели достижимыми шаг за шагом.\n\nИ, наконец, ответственность — как индивидуальная, так и командная. Я считаю важным брать на себя каждую задачу надлежащим и профессиональным образом, понимая её влияние на целое и действуя с обязательством. Всегда отдавать максимум — это форма уважения к проекту и к людям, которые над ним работают; это основа для продвижения любой инициативы и построения доверия со временем.",
        "ja": "私の人格は三つの基本的な柱の上に成り立っています。第一は好奇心です。\n\nこれはコンピュータの世界において欠かせない原動力であり、市場の新しい動向に常に注意を向けること、そして同時に学びを継続的に深め、広げていくことへと私を駆り立てます。そのおかげで、私は新しいツールやトレンドを発見するだけでなく、なぜそれらが生まれるのか、何のためにあるのか、そしてどのように実際の価値をもたらし得るのかを理解するための批判的な視点も育まれます。\n\n第二の柱は継続性です。日々成長し変化していく領域において、プロジェクトはますます大規模で高度になります。継続性は、努力を持続し、仕事を整理し、ときに現れる単調さを乗り越えることを可能にし、焦点や品質を失わないよう支えます。良い意図を結果へと変え、目標を一歩一歩実現可能にする規律でもあります。\n\n最後に、責任——個人としてもチームとしても。私は、すべてのタスクを適切かつプロフェッショナルに引き受け、その全体への影響を理解し、コミットメントをもって行動することが重要だと考えています。常に最善を尽くすことは、プロジェクトと共に働く人々への敬意の表れであり、どのような取り組みでも前へ進め、時間をかけて信頼を築くための土台となります。"
    },
    "title": {
        "es": "Desarrollador Full Stack & Mobile",
        "en": "Full Stack & Mobile Developer",
        "fr": "Développeur Full Stack & Mobile",
        "de": "Full-Stack- und Mobile-Entwickler",
        "it": "Sviluppatore Full Stack & Mobile",
        "pt": "Desenvolvedor Full Stack & Mobile",
        "nl": "Full-Stack- en Mobile-ontwikkelaar",
        "pl": "Programista Full Stack & Mobile",
        "ru": "Разработчик Full Stack & Mobile",
        "ja": "フルスタック&モバイル開発者"
    },
    "bio": {
        "es": "Ingeniero full stack y mobile: diseño frontends rápidos, APIs sólidas y experiencias móviles listas para producción.",
        "en": "Full stack and mobile engineer: design fast frontends, solid APIs and production-ready mobile experiences.",
        "fr": "Ingénieur full stack et mobile : concevoir des frontends rapides, des API solides et des expériences mobiles prêtes pour la production.",
        "de": "Full-Stack- und Mobile-Ingenieur: Entwerfen Sie schnelle Frontends, solide APIs und produktionsreife mobile Erfahrungen.",
        "it": "Ingegnere full stack e mobile: progettare frontend veloci, API solide ed esperienze mobile pronte per la produzione.",
        "pt": "Engenheiro full stack e mobile: projete frontends rápidos, APIs sólidas e experiências móveis prontas para produção.",
        "nl": "Full-stack- en mobileingenieur: ontwerp snelle frontends, solide API's en productieklare mobiele ervaringen.",
        "pl": "Inżynier full stack i mobile: projektuj szybkie frontendy, solidne interfejsy API i doświadczenia mobilne gotowe do produkcji.",
        "ru": "Инженер Full Stack и Mobile: разработайте быстрые интерфейсы, надежные API и готовые к производству мобильные приложения.",
        "ja": "フルスタック＆モバイルエンジニア：高速なフロントエンド、堅牢なAPI、本番対応のモバイルエクスペリエンスを設計します。"
    },
    "email": "sebssgarcia502580@gmail.com",
    "location": {
        "es": "Madrid, España",
        "en": "Madrid, Spain",
        "fr": "Madrid, Espagne",
        "de": "Madrid, Spanien",
        "it": "Madrid, Spagna",
        "pt": "Madrid, Espanha",
        "nl": "Madrid, Spanje",
        "pl": "Madryt, Hiszpania",
        "ru": "Мадрид, Испания",
        "ja": "マドリード、スペイン"
    },
    "profileImage": "/profile.jpg",
    "socialLinks": {
        "github": "https://github.com/Sebas1705",
        "codewars": "https://www.codewars.com/users/Sebas1705",
        "linkedin": "https://www.linkedin.com/in/sebastián-ramiro-entrerrios-garcía-b1a713217/"
    }
}
