[
    {
        "id": "agedi",
        "title": {
            "es": "Sistema AGEDI",
            "en": "AGEDI System",
            "fr": "Système AGEDI",
            "de": "AGEDI-System",
            "it": "Sistema AGEDI",
            "pt": "Sistema AGEDI",
            "nl": "AGEDI-systeem",
            "pl": "System AGEDI",
            "ru": "Система AGEDI",
            "ja": "AGEDIシステム"
        },
        "description": {
            "es": "Plataforma de gestión empresarial para AGEDI.",
            "en": "Enterprise management platform for AGEDI.",
            "fr": "Plateforme de gestion d'entreprise pour AGEDI.",
            "de": "Unternehmensmanagement-Plattform für AGEDI.",
            "it": "Piattaforma di gestione aziendale per AGEDI.",
            "pt": "Plataforma de gerenciamento empresarial para AGEDI.",
            "nl": "Ondernemingsmanagementplatform voor AGEDI.",
            "pl": "Platforma zarządzania przedsiębiorstwem dla AGEDI.",
            "ru": "Платформа управления предприятием для AGEDI.",
            "ja": "AGEDI向けエンタープライズ管理プラットフォーム"
        },
        "technologies": ["csharp", "dotnet", "sqlserver", "microsoft-powerbi", "sqlservermagment", "azure", "azure-data-studio", "html", "css", "javascript", "git", "source-tree"],
        "startDate": "2024-10-01",
        "imageUrl": "/projects/agedi.jpg",
        "type": "work",
        "relatedTo": ["work-1", "work-2"]
    },
    {
        "id": "sisley",
        "title": {
            "es": "Sistema Sisley",
            "en": "Sisley System",
            "fr": "Système Sisley",
            "de": "Sisley-System",
            "it": "Sistema Sisley",
            "pt": "Sistema Sisley",
            "nl": "Sisley-systeem",
            "pl": "System Sisley",
            "ru": "Система Sisley",
            "ja": "Sisleyシステム"
        },
        "description": {
            "es": "Aplicación web y backend para gestión de contenido de Sisley.",
            "en": "Web application and backend for Sisley content management.",
            "fr": "Application web et backend pour la gestion de contenu Sisley.",
            "de": "Webanwendung und Backend für die Sisley-Inhaltsverwaltung.",
            "it": "Applicazione web e backend per la gestione dei contenuti Sisley.",
            "pt": "Aplicação web e backend para gerenciamento de conteúdo Sisley.",
            "nl": "Webtoepassing en backend voor Sisley-inhoudsbeheer.",
            "pl": "Aplikacja internetowa i backend do zarządzania treścią Sisley.",
            "ru": "Веб-приложение и бэкэнд для управления контентом Sisley.",
            "ja": "Sisley向けコンテンツ管理用Webアプリケーションおよびバックエンド"
        },
        "technologies": ["csharp", "dotnet", "sqlserver", "azure", "mvc"],
        "startDate": "2024-10-01",
        "type": "work",
        "imageUrl": "/projects/sisley.png",
        "relatedTo": ["work-1", "work-2"]
    },
    {
        "id": "iberext",
        "title": {
            "es": "Sistema Iberext",
            "en": "Iberext System",
            "fr": "Système Iberext",
            "de": "Iberext-System",
            "it": "Sistema Iberext",
            "pt": "Sistema Iberext",
            "nl": "Iberext-systeem",
            "pl": "System Iberext",
            "ru": "Система Iberext",
            "ja": "Iberextシステム"
        },
        "description": {
            "es": "Aplicación móvil para gestión de sistemas de prevención de incendios.",
            "en": "Mobile application for fire prevention systems management.",
            "fr": "Application mobile pour la gestion des systèmes de prévention des incendies.",
            "de": "Mobilanwendung für die Verwaltung von Brandschutzsystemen.",
            "it": "Applicazione mobile per la gestione dei sistemi antincendio.",
            "pt": "Aplicativo móvel para gerenciamento de sistemas de prevenção de incêndio.",
            "nl": "Mobiele toepassing voor brandpreventiesysteembeheer.",
            "pl": "Aplikacja mobilna do zarządzania systemami ochrony przeciwpożarowej.",
            "ru": "Мобильное приложение для управления системами пожарной безопасности.",
            "ja": "火災予防システム管理用モバイルアプリケーション"
        },
        "technologies": ["kotlin", "jetpack-compose", "csharp", "dotnet", "sqlserver", "firebase", "git", "source-tree"],
        "startDate": "2024-10-01",
        "type": "work",
        "imageUrl": "/projects/iberext.jpg",
        "relatedTo": ["work-1", "work-2"]
    },
    {
        "id": "epdm",
        "title": {
            "es": "EPDM - Portal de la Música",
            "en": "EPDM - Music Portal",
            "fr": "EPDM - Portail Musicale",
            "de": "EPDM - Musikportal",
            "it": "EPDM - Portale Musicale",
            "pt": "EPDM - Portal da Música",
            "nl": "EPDM - Muziekportaal",
            "pl": "EPDM - Portal Muzyki",
            "ru": "EPDM - Музыкальный портал",
            "ja": "EPDM - 音楽ポータル"
        },
        "description": {
            "es": "Aplicación móvil para Portal de la Música con gestión de contenido musical con derechos manejados por AGEDI.",
            "en": "Mobile application for Music Portal with management of music content with rights managed by AGEDI.",
            "fr": "Application mobile pour le Portail de la Musique avec gestion de contenu musical avec droits gérés par AGEDI.",
            "de": "Mobile Anwendung für das Musikportal mit Verwaltung von Musikinhalt mit Rechten, die von AGEDI verwaltet werden.",
            "it": "Applicazione mobile per il Portale della Musica con gestione dei contenuti musicali con diritti gestiti da AGEDI.",
            "pt": "Aplicativo móvel para o Portal da Música com gerenciamento de conteúdo musical com direitos gerenciados pela AGEDI.",
            "nl": "Mobiele toepassing voor Muziekportaal met beheer van muziekinhoud met rechten beheerd door AGEDI.",
            "pl": "Aplikacja mobilna dla Portalu Muzyki z zarządzaniem treści muzycznych z prawami zarządzanymi przez AGEDI.",
            "ru": "Мобильное приложение для Музыкального портала с управлением музыкальным контентом с правами, управляемыми AGEDI.",
            "ja": "AGEDIが管理する権利を持つ音楽コンテンツの管理を備えた音楽ポータル向けモバイルアプリケーション"
        },
        "technologies": ["kotlin", "jetpack-compose", "csharp", "dotnet", "sqlserver", "firebase", "git", "source-tree"],
        "imageUrl": "/projects/epdm.png",
        "demoUrl": "https://play.google.com/store/apps/details?id=es.solusoft.epdm&hl=es_419&pli=1",
        "startDate": "2025-03-01",
        "type": "work",
        "relatedTo": ["work-1", "work-2"]
    },
    {
        "id": "youknow",
        "title": {
            "es": "YouKnow",
            "en": "YouKnow",
            "fr": "YouKnow",
            "de": "YouKnow",
            "it": "YouKnow",
            "pt": "YouKnow",
            "nl": "YouKnow",
            "pl": "YouKnow",
            "ru": "YouKnow",
            "ja": "YouKnow"
        },
        "description": {
            "es": "Aplicación móvil basada en una red social para chatear, agruparse y jugar a juegos educativos, donde se ha querido implementar la gamificación.",
            "en": "Mobile application based on a social network to chat, group and play educational games, where gamification has been implemented.",
            "fr": "Application mobile basée sur un réseau social pour discuter, se regrouper et jouer à des jeux éducatifs, où la gamification a été mise en œuvre.",
            "de": "Mobile Anwendung basierend auf einem sozialen Netzwerk zum Chatten, Gruppieren und Spielen von Bildungsspielen, bei dem Gamification implementiert wurde.",
            "it": "Applicazione mobile basata su un social network per chattare, raggrupparsi e giocare a giochi educativi, dove è stata implementata la gamification.",
            "pt": "Aplicativo móvel baseado em uma rede social para conversar, agrupar e jogar jogos educativos, onde a gamificação foi implementada.",
            "nl": "Mobiele toepassing gebaseerd op een sociaal netwerk om te chatten, groeperen en educatieve spellen te spelen, waar gamification is geïmplementeerd.",
            "pl": "Aplikacja mobilna oparta na sieci społecznościowej do czatowania, grupowania i grania w gry edukacyjne, w której zaimplementowano grywalizację.",
            "ru": "Мобильное приложение, основанное на социальной сети для общения, группировки и игры в образовательные игры, где реализована геймификация.",
            "ja": "チャット、グループ化、教育ゲームをプレイするためのソーシャルネットワークに基づくモバイルアプリケーションで、ゲーミフィケーションが実装されています。"
        },
        "technologies": ["kotlin", "jetpack-compose", "firebase", "git", "source-tree", "figma", "xml"],
        "imageUrl": "/projects/YouKnow.svg",
        "repoUrl": "https://github.com/Sebas1705/YouKnow",
        "startDate": "2024-01-09",
        "endDate": "2025-08-30",
        "type": "academic",
        "relatedTo": ["academic-2"]
    },
    {
        "id": "vpslocalorchestrator",
        "title": {
            "es": "VPS Orquestador local",
            "en": "Local VPS Orchestrator",
            "fr": "Orchestrateur VPS local",
            "de": "Lokaler VPS-Orchestrator",
            "it": "Orchestratore VPS locale",
            "pt": "Orquestrador VPS local",
            "nl": "Lokale VPS Orchestrator",
            "pl": "Lokalny Orkiestrator VPS",
            "ru": "Локальный оркестратор VPS",
            "ja": "ローカルVPSオーケストレーター"
        },
        "description": {
            "es": "Orquestador de recursos local para sistemas VPS con sistema operativo Linux. Permite manejar desde recursos y métricas simples hasta automatizaciones avanzadas.",
            "en": "Local resource orchestrator for VPS systems with Linux operating system. It allows managing from simple resources and metrics to advanced automations.",
            "fr": "Orchestrateur de ressources local pour les systèmes VPS avec système d'exploitation Linux. Il permet de gérer des ressources et des métriques simples jusqu'à des automatisations avancées.",
            "de": "Lokaler Ressourcenorchestrator für VPS-Systeme mit Linux-Betriebssystem. Es ermöglicht die Verwaltung von einfachen Ressourcen und Metriken bis hin zu fortgeschrittenen Automatisierungen.",
            "it": "Orchestratore di risorse locale per sistemi VPS con sistema operativo Linux. Permette di gestire da risorse e metriche semplici ad automazioni avanzate.",
            "pt": "Orquestrador de recursos local para sistemas VPS com sistema operacional Linux. Permite gerenciar desde recursos e métricas simples até automações avançadas.",
            "nl": "Lokale resource-orchestrator voor VPS-systemen met Linux-besturingssysteem. Hiermee kunnen eenvoudige bronnen en statistieken tot geavanceerde automatiseringen worden beheerd.",
            "pl": "Lokalny orkiestrator zasobów dla systemów VPS z systemem operacyjnym Linux. Umożliwia zarządzanie od prostych zasobów i metryk po zaawansowane automatyzacje.",
            "ru": "Локальный оркестратор ресурсов для систем VPS с операционной системой Linux. Позволяет управлять от простых ресурсов и метрик до продвинутых автоматизаций.",
            "ja": "Linuxオペレーティングシステムを搭載したVPSシステム向けのローカルリソースオーケストレーター。単純なリソースとメトリクスから高度な自動化まで管理できます。"
        },
        "technologies": ["express", "nodejs", "typescript", "docker", "mongodb", "jest"],
        "imageUrl": "/projects/vpslocalorchestrator.png",
        "repoUrl": "https://github.com/Sebas1705/VPSLocalOrchestrator",
        "startDate": "2025-12-20",
        "type": "academic",
        "relatedTo": ["academic-3"]
    },
    {
        "id": "oortfolio",
        "title": {
            "es": "Portafolio Personal",
            "en": "Personal Portfolio",
            "fr": "Portfolio Personnel",
            "de": "Persönliches Portfolio",
            "it": "Portafoglio Personale",
            "pt": "Portfólio Pessoal",
            "nl": "Persoonlijk Portfolio",
            "pl": "Osobiste Portfolio",
            "ru": "Личное портфолио",
            "ja": "パーソナルポートフォリオ"
        },
        "description": {
            "es": "Web creada con Astro y Nodejs para mostrar mis proyectos y habilidades. Optimizada y diseñada con tailwindcss, y desplegada en VPS propia con baterias de pruebas y despliegue automático con reconcimiento de errores.",
            "en": "Website created with Astro and Nodejs to showcase my projects and skills. Optimized and designed with tailwindcss, and deployed on my own VPS with test suites and automatic deployment with error recognition.",
            "fr": "Site web créé avec Astro et Nodejs pour présenter mes projets et compétences. Optimisé et conçu avec tailwindcss, et déployé sur mon propre VPS avec des suites de tests et un déploiement automatique avec reconnaissance des erreurs.",
            "de": "Website erstellt mit Astro und Nodejs, um meine Projekte und Fähigkeiten zu präsentieren. Optimiert und gestaltet mit tailwindcss und auf meinem eigenen VPS mit Test-Suites und automatischer Bereitstellung mit Fehlererkennung bereitgestellt.",
            "it": "Sito web creato con Astro e Nodejs per mostrare i miei progetti e competenze. Ottimizzato e progettato con tailwindcss, e distribuito sul mio VPS con suite di test e distribuzione automatica con riconoscimento degli errori.",
            "pt": "Site criado com Astro e Nodejs para mostrar meus projetos e habilidades. Otimizado e projetado com tailwindcss, e implantado em meu próprio VPS com suítes de teste e implantação automática com reconhecimento de erros.",
            "nl": "Website gemaakt met Astro en Nodejs om mijn projecten en vaardigheden te laten zien. Geoptimaliseerd en ontworpen met tailwindcss, en gedeployed op mijn eigen VPS met test suites en automatische deployment met foutherkenning.",
            "pl": "Strona internetowa stworzona za pomocą Astro i Nodejs, aby zaprezentować moje projekty i umiejętności. Zoptymalizowana i zaprojektowana za pomocą tailwindcss oraz wdrożona na moim własnym VPS z zestawami testów i automatycznym wdrażaniem z rozpoznawaniem błędów.",
            "ru": "Веб-сайт, созданный с помощью Astro и Nodejs для демонстрации моих проектов и навыков. Оптимизирован и разработан с использованием tailwindcss, и развернут на моем собственном VPS с тестовыми наборами и автоматическим развертыванием с распознаванием ошибок.",
            "ja": "AstroとNodejsで作成されたウェブサイトで、私のプロジェクトとスキルを紹介しています。tailwindcssで最適化および設計されており、独自のVPSにテストスイートとエラー認識を備えた自動展開で展開されています。"
        },
        "technologies": ["astro", "nodejs", "typescript", "docker", "docker-compose", "tailwindcss", "vitest", "playright"],
        "imageUrl": "/projects/portfolio.png",
        "repoUrl": "https://github.com/Sebas1705/my-portfolio",
        "startDate": "2025-12-20",
        "type": "academic",
        "relatedTo": ["academic-3"]
    }
]
